<a href="https://colab.research.google.com/github/tomasz-soltysiak/NLP_IndianLanguage/blob/master/NLP_models.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import matplotlib.patches as mpatches
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from sklearn.preprocessing import RobustScaler, StandardScaler
from sklearn.model_selection import train_test_split,StratifiedKFold
from sklearn.manifold import TSNE
from sklearn.cluster import KMeans
from sklearn.decomposition import PCA
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score
from sklearn.metrics import recall_score, precision_score, f1_score, accuracy_score,roc_curve,confusion_matrix,roc_auc_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier

In [2]:
df=pd.read_csv('/content/Tamil_movie_reviews_train2.csv')
df.head()

   Unnamed: 0  ...                                              wages
0           0  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
1           1  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
2           2  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
3           3  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
4           4  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...

[5 rows x 6 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 6 columns):
Unnamed: 0       121 non-null int64
ReviewId         121 non-null int64
ReviewInTamil    121 non-null object
Rating           121 non-null float64
bag_of_words     121 non-null object
wages            121 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 5.8+ KB

In [10]:
df['wages']=np.array(df['wages'])
df.head()

   Unnamed: 0  ...                                              wages
0           0  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
1           1  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
2           2  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
3           3  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...
4           4  ...    (0, 448)\t0.054201212070610044\n  (0, 563)\t...

[5 rows x 6 columns]